Fix: Stop generating issue
